SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( CPde101  
	Type ( Engine )
	WagonShape ( cpde101.s )
	Include ( "Openrails/1general.inc" )
	Include ( "Openrails/2brakewv.inc" )
	Include ( "Openrails/3friction.inc" )
	Include ( "Openrails/4light.inc" )


	IntakePoint ( -3.33 0.4 FuelDiesel )
	IntakePoint ( 3.33 0.4 FuelDiesel )
)

Engine ( CPde101
	Wagon ( Cpde101 )
	Name ( "CP DE 101 Alco" )
	Sound ( 1500cab.sms )
	CabView ( cp1501.cvf )

	Include ( "Openrails/effects.inc" )
	Include ( "Openrails/5engine.inc" )
	Include ( "Openrails/6brakesys.inc" )
	Include ( "Openrails/7other.inc" )
 	Include ( "Openrails/9controllers.inc" )
	Include ( "Openrails/procedures1500.inc" )

	VigilanceMonitor(
		MonitoringDeviceAlarmTimeLimit		( 45s )
		MonitoringDeviceMonitorTimeLimit		( 37s )
		MonitoringDevicePenaltyTimeLimit		( 1s )
		MonitoringDeviceCriticalLevel			( 0 )
		MonitoringDeviceResetLevel			( 0 )
		MonitoringDeviceAppliesFullBrake		( 1 )
		MonitoringDeviceAppliesEmergencyBrake	( 0 )
		MonitoringDeviceAppliesCutsPower		( 1 )
		MonitoringDeviceAppliesShutsDownEngine	( 1 )
		MonitoringDeviceResetOnDirectionNeutral	( 0 )
		MonitoringDeviceResetOnResetButton		( 1 )
		MonitoringDeviceResetOnZeroSpeed 		( 1 )
	)	
	EmergencyStopMonitor(
		MonitoringDeviceAlarmTimeLimit 		( 2 )
		MonitoringDeviceMonitorTimeLimit 		( 5 )
		MonitoringDevicePenaltyTimeLimit 		( 0 )
		MonitoringDeviceCriticalLevel 		( 106 )
		MonitoringDeviceResetLevel 			( 0 )
		MonitoringDeviceAppliesFullBrake 		( 0 )
		MonitoringDeviceAppliesEmergencyBrake 	( 1 )
		MonitoringDeviceAppliesCutsPower 		( 1 )
		MonitoringDeviceAppliesShutsDownEngine 	( 1 )
		MonitoringDeviceResetOnDirectionNeutral	( 0 )
		MonitoringDeviceResetOnResetButton 		( 1 )
		MonitoringDeviceResetOnZeroSpeed 		( 0 )
	)
    	Description (	
	"CP 1500 Series diesel-electric locomotive\n\n"+
	"Entered service in 1948\n\n"+
	"Wheel Arrangement: A1A A1A\n\n"+
	"Brake Type: Vacuum\n\n"+
	"Livery: Silver and Green with old CP number scheme"
    	)
)
